{
    "projects": [
        {
            "title": "Project 1: develop a fictitious company website",
            "description": "The project was about giving the user the opportunity to visit a website where they can find information about the company. Not only can the user view basic information about the company, but they can also leave feedback or delete existing feedback. In addition, a mobile version of the website was developed to ensure that users can access the information regardless of their device.",
            "image": "fiktives-unternehmung.png",
            "link": "https://portfolio.bbbaden.ch/view/view.php?t=00a920907a558595b588"
        },
        {
            "title": "Project 2: Number-System",
            "description": "Our project is about creating a calculator that is used to convert number systems. In the menu you can choose whether you want to convert from hexadecimal to decimal, decimal to binary, decimal to octal or vice versa.",
            "image": "Zahlensystem.png",
            "link": "https://portfolio.bbbaden.ch/view/view.php?t=347fea6d72b92423c7f3"
        },
        {
            "title": "Project 3: Quiz-Backend",
            "description": "In LA1303 I have implemented a quiz with backend only. The point here is that the user can write questions and answers at the same time and this is saved. The user can call up, change and delete the words with the help of the ID of the desired card. I used the ASP.NET Core Web API in Visual Studio for this.",
            "image": "Backend.png",
            "link": "https://portfolio.bbbaden.ch/view/view.php?t=09c3181453705eb502cc"
        },
        {
            "title": "Project 4: develop a website about flowers",
            "description": "This is about the fact that I have developed a website that stands about the flower. It contains information, its history, how to take care of it and where to buy it. You can also view it on a mobile phone version.",
            "image": "AWS.png",
            "link": "https://portfolio.bbbaden.ch/view/view.php?t=c72e0c60c4db00c611a2"
        },
        {
            "title": "Project 5: Number-System",
            "description": "Module 346 is about creating Drupal on AWS",
            "image": "AWS.png",
            "link": "https://portfolio.bbbaden.ch/view/view.php?t=c72e0c60c4db00c611a2"
        }
    ],
    "hobbies": [
        {
            "title": "Coding",
            "description": "In my free time, I like to try new designs or functions to sharpen my coding skills. Each project teaches me something new and improve my skill.",
            "image": "Code.jpeg"
        },
        {
            "title": "Dancing",
            "description": "I joined the Space Dance class in Aarau, where I love the freedom of dancing alone or in a group. Dancing allows me to escape and create my own world, which keeps me motivated and energized.",
            "image": "Dance.jpeg"
        },
        {
            "title": "Basketball",
            "description": "I often play basketball with my friends or my younger brother. Although I stopped going to basketball classes after three years. However, I still enjoy teaching my brother helpful tips to improve his game.",
            "image": "Basketball.jpeg"
        }
    ],
    "technologies": [
        {
            "name": "HTML"
        },
        {
            "name": "CSS"
        },
        {
            "name": "JavaScript"
        },
        {
            "name": "C#"
        },
        {
            "name": "AWS"
        },
        {
            "name": "SQL"
        },
        {
            "name": "Docker"
        },
        {
            "name": "MongoDB"
        }
    ]
}